burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_uart.c
/*!
    \file    gd32m53x_uart.c
    \brief   UART driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32m53x_uart.h"

/*!
    \brief      reset UART (API_ID(0x0001U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_deinit(uint32_t uart_periph)
{
    switch(uart_periph) {
    case UART0:
        rcu_periph_reset_enable(RCU_UART0RST);
        rcu_periph_reset_disable(RCU_UART0RST);
        break;
    case UART1:
        rcu_periph_reset_enable(RCU_UART1RST);
        rcu_periph_reset_disable(RCU_UART1RST);
        break;
    case UART2:
        rcu_periph_reset_enable(RCU_UART2RST);
        rcu_periph_reset_disable(RCU_UART2RST);
        break;
    case UART3:
        rcu_periph_reset_enable(RCU_UART3RST);
        rcu_periph_reset_disable(RCU_UART3RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure UART baud rate value (API_ID(0x0002U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  baudval: baud rate value
    \param[out] none
    \retval     none
*/
void uart_baudrate_set(uint32_t uart_periph, uint32_t baudval)
{
    uint32_t uclk = 0U, intdiv, fradiv, udiv;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_UART_BAUDRATE(baudval)) {
        fw_debug_report_err(UART_MODULE_ID, API_ID(0x0002U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        switch(uart_periph) {
        /* get clock frequency */
        case UART0:
            uclk = rcu_clock_freq_get(CK_APB1);
            break;
        case UART1:
            uclk = rcu_clock_freq_get(CK_APB1);
            break;
        case UART2:
            uclk = rcu_clock_freq_get(CK_APB1);
            break;
        case UART3:
            uclk = rcu_clock_freq_get(CK_APB1);
            break;
        default:
            break;
        }
        if(UART_OVSMOD_8 == (UART_CTL0(uart_periph) & UART_CTL0_OVSMOD)) {
            /* when oversampling by 8, configure the value of UART_BAUD */
            udiv = ((2U * uclk) + (baudval / 2U)) / baudval;
            intdiv = udiv & 0x000ffff0U;
            fradiv = (udiv >> 1U) & 0x00000007U;
            UART_BAUD(uart_periph) = ((UART_BAUD_FRADIV | UART_BAUD_INTDIV) & (intdiv | fradiv));
        } else {
            /* when oversampling by 16, configure the value of UART_BAUD */
            udiv = (uclk + (baudval / 2U)) / baudval;
            intdiv = udiv & 0x000ffff0U;
            fradiv = udiv & 0x0000000fU;
            UART_BAUD(uart_periph) = ((UART_BAUD_FRADIV | UART_BAUD_INTDIV) & (intdiv | fradiv));
        }
    }
}

/*!
    \brief     configure UART parity function (API_ID(0x0003))
    \param[in] uart_periph: UARTx(x = 0,1,2,3)
    \param[in] paritycfg: configure UART parity
               only one parameter can be selected which is shown as below:
      \arg       UART_PM_NONE: no parity
      \arg       UART_PM_EVEN: even parity
      \arg       UART_PM_ODD:  odd parity
    \param[out] none
    \retval     none
*/
void uart_parity_config(uint32_t uart_periph, uint32_t paritycfg)
{
    /* clear UART_CTL0 PM,PCEN Bits */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_PM | UART_CTL0_PCEN);
    /* configure UART parity mode */
    UART_CTL0(uart_periph) |= paritycfg & (UART_CTL0_PM | UART_CTL0_PCEN);
}

/*!
    \brief     configure UART word length (API_ID(0x0004U))
    \param[in] uart_periph: UARTx(x = 0,1,2,3)
    \param[in] wlen: UART word length configure
               only one parameter can be selected which is shown as below:
      \arg       UART_WL_8BIT: 8 bits
      \arg       UART_WL_9BIT: 9 bits
      \arg       UART_WL_7BIT: 7 bits
      \arg       UART_WL_10BIT: 10 bits
    \param[out] none
    \retval     none
*/
void uart_word_length_set(uint32_t uart_periph, uint32_t wlen)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* clear UART_CTL0 WL bit */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_WL0 | UART_CTL0_WL1);
    /* configure UART word length */
    UART_CTL0(uart_periph) |= wlen & (UART_CTL0_WL0 | UART_CTL0_WL1);

}

/*!
    \brief     configure UART stop bit length (API_ID(0x0005U))
    \param[in] uart_periph: UARTx(x = 0,1,2,3)
    \param[in] stblen: UART stop bit configure
               only one parameter can be selected which is shown as below:
      \arg       UART_STB_1BIT: 1 bit
      \arg       UART_STB_2BIT: 2 bits
    \param[out] none
    \retval     none
*/
void uart_stop_bit_set(uint32_t uart_periph, uint32_t stblen)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* clear UART_CTL1 STB bits */
    UART_CTL1(uart_periph) &= ~UART_CTL1_STB;
    /* configure UART stop bits */
    UART_CTL1(uart_periph) |= stblen & UART_CTL1_STB;
}
/*!
    \brief    enable UART (API_ID(0x0006U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_enable(uint32_t uart_periph)
{
    UART_CTL0(uart_periph) |= UART_CTL0_UEN;
}

/*!
    \brief      disable UART (API_ID(0x0007U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_disable(uint32_t uart_periph)
{
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
}

/*!
    \brief    configure UART transmitter (API_ID(0x0008U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  txconfig: enable or disable UART transmitter
                only one parameter can be selected which is shown as below:
      \arg        UART_TRANSMIT_ENABLE: enable UART transmission
      \arg        UART_TRANSMIT_DISABLE: disable UART transmission
    \param[out] none
    \retval     none
*/
void uart_transmit_config(uint32_t uart_periph, uint32_t txconfig)
{
    /* disable transmitter */
    UART_CTL0(uart_periph) &= ~UART_CTL0_TEN;
    /* configure transfer mode */
    UART_CTL0(uart_periph) |= txconfig & UART_CTL0_TEN;
}

/*!
    \brief    configure UART receiver (API_ID(0x0009U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  rxconfig: enable or disable UART receiver
                only one parameter can be selected which is shown as below:
      \arg        UART_RECEIVE_ENABLE: enable UART reception
      \arg        UART_RECEIVE_DISABLE: disable UART reception
    \param[out] none
    \retval     none
*/
void uart_receive_config(uint32_t uart_periph, uint32_t rxconfig)
{
    /* disable receiver */
    UART_CTL0(uart_periph) &= ~UART_CTL0_REN;
    /* configure receiver mode */
    UART_CTL0(uart_periph) |= rxconfig & UART_CTL0_REN;
}

/*!
    \brief    data is transmitted/received with the LSB/MSB first (API_ID(0x000AU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  msbf: LSB/MSB
                only one parameter can be selected which is shown as below:
      \arg        UART_MSBF_LSB: LSB first
      \arg        UART_MSBF_MSB: MSB first
    \param[out] none
    \retval     none
*/
void uart_data_first_config(uint32_t uart_periph, uint32_t msbf)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* configure LSB or MSB first */
    UART_CTL2(uart_periph) &= ~(UART_CTL2_MSBF);
    UART_CTL2(uart_periph) |= (UART_CTL2_MSBF & msbf);
}

/*!
    \brief    configure UART inversion (API_ID(0x000BU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  invertpara: refer to enum UART_INVERT_CONFIG
                only one parameter can be selected which is shown as below:
      \arg        UART_DINV_ENABLE: data bit level inversion
      \arg        UART_DINV_DISABLE: data bit level not inversion
      \arg        UART_TXPIN_ENABLE: TX pin level inversion
      \arg        UART_TXPIN_DISABLE: TX pin level not inversion
      \arg        UART_RXPIN_ENABLE: RX pin level inversion
      \arg        UART_RXPIN_DISABLE: RX pin level not inversion
    \param[out] none
    \retval     none
*/
void uart_invert_config(uint32_t uart_periph, uart_invert_enum invertpara)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* inverted or not the specified signal */
    switch(invertpara) {
    case UART_DINV_ENABLE:
        UART_CTL2(uart_periph) |= UART_CTL2_DINV;
        break;
    case UART_TXPIN_ENABLE:
        UART_CTL2(uart_periph) |= UART_CTL2_TINV;
        break;
    case UART_RXPIN_ENABLE:
        UART_CTL2(uart_periph) |= UART_CTL2_RINV;
        break;
    case UART_DINV_DISABLE:
        UART_CTL2(uart_periph) &= ~(UART_CTL2_DINV);
        break;
    case UART_TXPIN_DISABLE:
        UART_CTL2(uart_periph) &= ~(UART_CTL2_TINV);
        break;
    case UART_RXPIN_DISABLE:
        UART_CTL2(uart_periph) &= ~(UART_CTL2_RINV);
        break;
    default:
        break;
    }
}

/*!
    \brief    configure the UART oversample mode (API_ID(0x000CU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  oversamp: oversample value
                only one parameter can be selected which is shown as below:
      \arg        UART_OVSMOD_8: 8 bits
      \arg        UART_OVSMOD_16: 16 bits
    \param[out] none
    \retval     none
*/
void uart_oversample_config(uint32_t uart_periph, uint32_t oversamp)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /*  clear OVSMOD bit */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_OVSMOD);
    UART_CTL0(uart_periph) |= oversamp & UART_CTL0_OVSMOD;
}

/*!
    \brief      configure sample bit method (API_ID(0x000DU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  osb: sample bit
                only one parameter can be selected which is shown as below:
      \arg        UART_OSB_1bit: 1 bit
      \arg        UART_OSB_3bit: 3 bits
    \param[out] none
    \retval     none
*/
void uart_sample_bit_config(uint32_t uart_periph, uint32_t osb)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* clear OSB bit */
    UART_CTL2(uart_periph) &= ~(UART_CTL2_OSB);
    UART_CTL2(uart_periph) |= osb & UART_CTL2_OSB;
}

/*!
    \brief    UART transmit data function (API_ID(0x000EU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  data: data of transmission
    \param[out] none
    \retval     none
*/
void uart_data_transmit(uint32_t uart_periph, uint32_t data)
{
    UART_DATA(uart_periph) = (UART_DATA_DATA & data);
}

/*!
    \brief      UART receive data function (API_ID(0x000FU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     data of received
*/
uint16_t uart_data_receive(uint32_t uart_periph)
{
    uint16_t data = 0U;

    data  = (uint16_t)(GET_BITS(UART_DATA(uart_periph), 0U, 9U));
    return data;
}

/*!
    \brief      configure the address of the UART in wake up by address match mode (API_ID(0x0010U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  addr: address of UART
    \param[out] none
    \retval     none
*/
void uart_address_config(uint32_t uart_periph, uint8_t addr)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);

