burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_uart.c
    UART_CTL1(uart_periph) &= ~(UART_CTL1_ADDR);
    UART_CTL1(uart_periph) |= (UART_CTL1_ADDR & (uint32_t)addr);
}

/*!
    \brief      enable mute mode (API_ID(0x0011U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_mute_mode_enable(uint32_t uart_periph)
{
    UART_CTL0(uart_periph) |= UART_CTL0_RWU;
}

/*!
    \brief      disable mute mode (API_ID(0x0012U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_mute_mode_disable(uint32_t uart_periph)
{
    UART_CTL0(uart_periph) &= ~(UART_CTL0_RWU);
}

/*!
    \brief      configure wakeup method in mute mode (API_ID(0x0013U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  wmethod: two method be used to enter or exit the mute mode
                only one parameter can be selected which is shown as below:
      \arg        UART_WM_IDLE: idle line
      \arg        UART_WM_ADDR: address mask
    \param[out] none
    \retval     none
*/
void uart_mute_mode_wakeup_config(uint32_t uart_periph, uint32_t wmethod)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);

    UART_CTL0(uart_periph) &= ~(UART_CTL0_WM);
    UART_CTL0(uart_periph) |= wmethod & UART_CTL0_WM;
}

/*!
    \brief      enable LIN mode (API_ID(0x0014U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_lin_mode_enable(uint32_t uart_periph)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* enable LIN mode */
    UART_CTL1(uart_periph) |= UART_CTL1_LMEN;
}

/*!
    \brief      disable LIN mode (API_ID(0x0015U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_lin_mode_disable(uint32_t uart_periph)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* disable LIN mode */
    UART_CTL1(uart_periph) &= ~(UART_CTL1_LMEN);
}

/*!
    \brief      configure lin break frame length (API_ID(0x0016U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  lblen: lin break frame length
                only one parameter can be selected which is shown as below:
      \arg        UART_LBLEN_10B: 10 bits
      \arg        UART_LBLEN_11B: 11 bits
    \param[out] none
    \retval     none
*/
void uart_lin_break_detection_length_config(uint32_t uart_periph, uint32_t lblen)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);

    UART_CTL1(uart_periph) &= ~(UART_CTL1_LBLEN);
    UART_CTL1(uart_periph) |= (UART_CTL1_LBLEN & lblen);
}

/*!
    \brief      send break frame (API_ID(0x0017U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_send_break(uint32_t uart_periph)
{
    UART_CTL0(uart_periph) |= UART_CTL0_SBKCMD;
}

/*!
    \brief      enable half duplex mode (API_ID(0x0018U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_halfduplex_enable(uint32_t uart_periph)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    UART_CTL2(uart_periph) |= UART_CTL2_HDEN;
}

/*!
    \brief      disable half duplex mode (API_ID(0x0019U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_halfduplex_disable(uint32_t uart_periph)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    UART_CTL2(uart_periph) &= ~(UART_CTL2_HDEN);
}

/*!
    \brief      enable IrDA mode (API_ID(0x001AU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_irda_mode_enable(uint32_t uart_periph)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* enable IrDA mode */
    UART_CTL2(uart_periph) |= UART_CTL2_IREN;
}

/*!
    \brief      disable IrDA mode (API_ID(0x001BU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[out] none
    \retval     none
*/
void uart_irda_mode_disable(uint32_t uart_periph)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);
    /* disable IrDA mode */
    UART_CTL2(uart_periph) &= ~(UART_CTL2_IREN);
}

/*!
    \brief      configure the peripheral clock prescaler in UART IrDA low-power mode (API_ID(0x001CU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  psc: 0-0xFF
    \param[out] none
    \retval     none
*/
void uart_prescaler_config(uint32_t uart_periph, uint8_t psc)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);

    UART_GP(uart_periph) &= ~(UART_GP_PSC);
    UART_GP(uart_periph) |= (uint32_t)psc & UART_GP_PSC;
}

/*!
    \brief      configure IrDA low-power (API_ID(0x001DU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  irlp: IrDA low-power or normal
                only one parameter can be selected which is shown as below:
      \arg        UART_IRLP_LOW: low-power
      \arg        UART_IRLP_NORMAL: normal
    \param[out] none
    \retval     none
*/
void uart_irda_lowpower_config(uint32_t uart_periph, uint32_t irlp)
{
    /* disable UART */
    UART_CTL0(uart_periph) &= ~(UART_CTL0_UEN);

    UART_CTL2(uart_periph) &= ~(UART_CTL2_IRLP);
    UART_CTL2(uart_periph) |= (UART_CTL2_IRLP & irlp);
}

/*!
    \brief      configure parity check coherence mode (API_ID(0x001EU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  pcm:
                only one parameter can be selected which is shown as below:
      \arg        UART_PCM_NONE: not check parity
      \arg        UART_PCM_EN:   check the parity
    \param[out] none
    \retval     none
*/
void uart_parity_check_coherence_config(uint32_t uart_periph, uint32_t pcm)
{
    UART_CHC(uart_periph) &= ~(UART_CHC_PCM);
    UART_CHC(uart_periph) |= (UART_CHC_PCM & pcm);
}

/*!
    \brief      configure UART DMA reception (API_ID(0x001FU))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  dmacmd: enable or disable DMA for reception
                only one parameter can be selected which is shown as below:
      \arg        UART_RECEIVE_DMA_ENABLE: DMA enable for reception
      \arg        UART_RECEIVE_DMA_DISABLE: DMA disable for reception
    \param[out] none
    \retval     none
*/
void uart_dma_receive_config(uint32_t uart_periph, uint32_t dmacmd)
{
    UART_CTL2(uart_periph) &= ~(UART_CTL2_DENR);
    UART_CTL2(uart_periph) |= (UART_CTL2_DENR & dmacmd);
}

/*!
    \brief      configure UART DMA transmission (API_ID(0x0020U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  dmacmd: enable or disable DMA for transmission
                only one parameter can be selected which is shown as below:
      \arg        UART_TRANSMIT_DMA_ENABLE:  DMA enable for transmission
      \arg        UART_TRANSMIT_DMA_DISABLE: DMA disable for transmission
    \param[out] none
    \retval     none
*/
void uart_dma_transmit_config(uint32_t uart_periph, uint32_t dmacmd)
{
    UART_CTL2(uart_periph) &= ~(UART_CTL2_DENT);
    UART_CTL2(uart_periph) |= (UART_CTL2_DENT & dmacmd);
}

/*!
    \brief      get flag in STAT0/CHC register (API_ID(0x0021U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  flag: UART flags, refer to uart_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        UART_FLAG_LBD: LIN break detected flag
      \arg        UART_FLAG_TBE: transmit data buffer empty
      \arg        UART_FLAG_TC: transmission complete
      \arg        UART_FLAG_RBNE: read data buffer not empty
      \arg        UART_FLAG_IDLE: IDLE frame detected flag
      \arg        UART_FLAG_ORERR: overrun error
      \arg        UART_FLAG_NERR: noise error flag
      \arg        UART_FLAG_FERR: frame error flag
      \arg        UART_FLAG_PERR: parity error flag
      \arg        UART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus uart_flag_get(uint32_t uart_periph, uart_flag_enum flag)
{
    FlagStatus status = RESET;

    if((uint32_t)RESET != (UART_REG_VAL(uart_periph, flag) & BIT(UART_BIT_POS(flag)))) {
        status = SET;
    } else {
        status = RESET;
    }
    return status;
}

/*!
    \brief      clear flag in STAT0/CHC register (API_ID(0x0022U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  flag: UART flags, refer to uart_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        UART_FLAG_LBD: LIN break detected flag
      \arg        UART_FLAG_TC: transmission complete
      \arg        UART_FLAG_RBNE: read data buffer not empty
      \arg        UART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void uart_flag_clear(uint32_t uart_periph, uart_flag_enum flag)
{
    UART_REG_VAL(uart_periph, flag) &= ~BIT(UART_BIT_POS(flag));
}

/*!
    \brief      enable UART interrupt (API_ID(0x0023U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  interrupt: UART interrupts, refer to uart_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        UART_INT_PERR: parity error interrupt
      \arg        UART_INT_TBE: transmitter buffer empty interrupt
      \arg        UART_INT_TC: transmission complete interrupt
      \arg        UART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        UART_INT_IDLE: IDLE line detected interrupt
      \arg        UART_INT_LBD: LIN break detected interrupt
      \arg        UART_INT_ERR: error interrupt
    \param[out] none
    \retval     none
*/
void uart_interrupt_enable(uint32_t uart_periph, uart_interrupt_enum interrupt)
{
    UART_REG_VAL(uart_periph, interrupt) |= BIT(UART_BIT_POS(interrupt));
}

/*!
    \brief      disable UART interrupt (API_ID(0x0024U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  interrupt: UART interrupts, refer to uart_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        UART_INT_PERR: parity error interrupt
      \arg        UART_INT_TBE: transmitter buffer empty interrupt
      \arg        UART_INT_TC: transmission complete interrupt
      \arg        UART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        UART_INT_IDLE: IDLE line detected interrupt
      \arg        UART_INT_LBD: LIN break detected interrupt
      \arg        UART_INT_ERR: error interrupt
    \param[out] none
    \retval     none
*/
void uart_interrupt_disable(uint32_t uart_periph, uart_interrupt_enum interrupt)
{
    UART_REG_VAL(uart_periph, interrupt) &= ~BIT(UART_BIT_POS(interrupt));
}

/*!
    \brief      get UART interrupt and flag status (API_ID(0x0025U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  int_flag: UART interrupt flags, refer to uart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        UART_INT_FLAG_PERR: parity error interrupt and flag
      \arg        UART_INT_FLAG_TBE: transmitter buffer empty interrupt and flag
      \arg        UART_INT_FLAG_TC: transmission complete interrupt and flag
      \arg        UART_INT_FLAG_RBNE: read data buffer not empty interrupt and flag
      \arg        UART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        UART_INT_FLAG_IDLE: IDLE line detected interrupt and flag
      \arg        UART_INT_FLAG_LBD: LIN break detected interrupt and flag
      \arg        UART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        UART_INT_FLAG_ERR_NERR: error interrupt and noise error flag
      \arg        UART_INT_FLAG_ERR_FERR: error interrupt and frame error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus uart_interrupt_flag_get(uint32_t uart_periph, uart_interrupt_flag_enum int_flag)
{
    uint32_t intenable, flagstatus;
    FlagStatus status = RESET;

    /* get the interrupt enable bit status */
    intenable = (UART_REG_VAL(uart_periph, int_flag) & BIT(UART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (UART_REG_VAL2(uart_periph, int_flag) & BIT(UART_BIT_POS2(int_flag)));

    if((0U != flagstatus) && (0U != intenable)) {
        status =  SET;
    } else {
        status = RESET;
    }
    return status;
}

/*!
    \brief      clear UART interrupt flag in STAT0 register (API_ID(0x0026U))
    \param[in]  uart_periph: UARTx(x = 0,1,2,3)
    \param[in]  int_flag: UART interrupt flags, refer to uart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        UART_INT_FLAG_LBD: LIN break detected flag
      \arg        UART_INT_FLAG_TC: transmission complete
      \arg        UART_INT_FLAG_RBNE: read data buffer not empty
    \param[out] none
    \retval     none
*/
void uart_interrupt_flag_clear(uint32_t uart_periph, uart_interrupt_flag_enum int_flag)
{
    UART_REG_VAL2(uart_periph, int_flag) &= ~BIT(UART_BIT_POS2(int_flag));
}
